Отчёт по лабораторной работе № 2

№ группы: ПМ-2403
Выполнил: Комаров Максим Олегович
Вариант: 12

Содержание

	1.Постановка задачи
	2.Входные и выходные данные
	3.Выбор структуры данных
	4.Алгоритм
	5.Программа
	6.Анализ правильности решения


1)Постановка задачи

Написать программу на Java, которая выполняет следующие действия с одномерным массивом целых чисел:

	1.Считывает с консоли число N, затем N целых чисел и заполняет массив размером N.
	2.Размещает числа в массиве таким образом, чтобы сначала шли числа, являющиеся квадратами целых чисел, в порядке возрастания, затем остальные числа в порядке убывания.
	3.Находит и выводит количество чисел в массиве, которые являются кубами целых чисел.
	4.Выводит элементы массива, заменяя числа, являющиеся квадратами, на их квадратные корни, остальные числа оставляет без изменений.
	5.Заменяет каждое число в массиве на его факториал (если число неотрицательное) и выводит полученный массив.


2)Входные и выходные данные

Входные данные:

Введите размер массива (N): 7
Введите элементы массива: 1 4 16 10 7 3 27

Выходные данные:

	1.Отсортированный массив: [1, 4, 16, 10, 7, 3, 27]
	2.Количество чисел, являющихся кубами целых чисел: 2
	3.Массив после замены квадратов на квадратные корни: [1, 2, 4, 10, 7, 3, 27]
	4.Массив после замены каждого числа на его факториал: [1, 2, 24, 3628800, 5040, 6, 10888869450418352160768000000]


3)Выбор структуры данных

	1.Массив:
	•Используется массив int[] для хранения элементов.
	2.Списки:
	•Вспомогательные списки для разделения чисел на квадраты и остальные.
	3.Математические функции:
	•Используется класс Math для проверки квадратов и кубов чисел.


4)Алгоритм

	1.Считать размер массива N и N элементов.
	2.Разделить элементы массива на две группы:
	•Числа, являющиеся квадратами целых чисел.
	•Остальные числа.
	3.Отсортировать первую группу по возрастанию, вторую — по убыванию.
	4.Подсчитать количество чисел, являющихся кубами целых чисел.
	5.Пройти по массиву и заменить квадраты на их квадратные корни.
	6.Преобразовать массив, заменяя каждое число на его факториал.


5)Программа

import java.util.*;
import java.math.BigInteger;

public class Lab2 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        // 1. Считать размер массива и его элементы
        System.out.print("Введите размер массива (N): ");
        int N = scanner.nextInt();
        int[] array = new int[N];
        System.out.println("Введите элементы массива:");
        for (int i = 0; i < N; i++) {
            array[i] = scanner.nextInt();
        }

        // 2. Разделение массива на квадраты и остальные
        List<Integer> squares = new ArrayList<>();
        List<Integer> others = new ArrayList<>();
        for (int num : array) {
            if (isPerfectSquare(num)) {
                squares.add(num);
            } else {
                others.add(num);
            }
        }

        // Сортировка
        squares.sort(Comparator.naturalOrder());
        others.sort(Comparator.reverseOrder());

        // Объединение
        List<Integer> sortedArray = new ArrayList<>(squares);
        sortedArray.addAll(others);

        System.out.println("Отсортированный массив: " + sortedArray);

        // 3. Подсчёт чисел, являющихся кубами
        long cubeCount = sortedArray.stream().filter(Lab2::isPerfectCube).count();
        System.out.println("Количество чисел, являющихся кубами: " + cubeCount);

        // 4. Замена квадратов на квадратные корни
        List<Double> squareRootsArray = new ArrayList<>();
        for (int num : sortedArray) {
            if (isPerfectSquare(num)) {
                squareRootsArray.add(Math.sqrt(num));
            } else {
                squareRootsArray.add((double) num);
            }
        }
        System.out.println("Массив с заменой квадратов на квадратные корни: " + squareRootsArray);

        // 5. Замена на факториалы
        List<BigInteger> factorialsArray = new ArrayList<>();
        for (int num : sortedArray) {
            factorialsArray.add(num >= 0 ? factorial(num) : BigInteger.valueOf(num));
        }
        System.out.println("Массив с заменой на факториалы: " + factorialsArray);

        scanner.close();
    }

    // Проверка, является ли число квадратом
    private static boolean isPerfectSquare(int num) {
        int sqrt = (int) Math.sqrt(num);
        return sqrt * sqrt == num;
    }

    // Проверка, является ли число кубом
    private static boolean isPerfectCube(int num) {
        int cbrt = (int) Math.cbrt(num);
        return cbrt * cbrt * cbrt == num;
    }

    // Вычисление факториала
    private static BigInteger factorial(int num) {
        BigInteger result = BigInteger.ONE;
        for (int i = 2; i <= num; i++) {
            result = result.multiply(BigInteger.valueOf(i));
        }
        return result;
    }
}


6)Анализ правильности решения

Пример 1:

Ввод:
N, массив: [1, 4, 16, 10, 7, 3, 27]

Вывод:

	•Отсортированный массив: [1, 4, 16, 10, 7, 3, 27]
	•Количество кубов: 2
	•Массив с квадратными корнями: [1, 2, 4, 10, 7, 3, 27]
	•Массив с факториалами: [1, 2, 24, 3628800, 5040, 6, 10888869450418352160768000000]

Пример 2:

Ввод:
N, массив: [9, 8, 27, 6]

Вывод:

	•Отсортированный массив: [9, 27, 8, 6]
	•Количество кубов: 2
	•Массив с квадратными корнями: [3, 27, 8, 6]
	•Массив с факториалами: [6, 10888869450418352160768000000, 40320, 720]
